create database if not exists gb_5;
use gb_5;

drop table if exists academic_record;
create table academic_record
(
    name    varchar(45),
    quartal varchar(45),
    subject varchar(45),
    grade   int
);

insert into academic_record
values ('Александр', '1 четверть', 'математика', 4),
       ('Александр', '2 четверть', 'русский', 4),
       ('Александр', '3 четверть', 'физика', 5),
       ('Александр', '4 четверть', 'история', 4),
       ('Антон', '1 четверть', 'математика', 4),
       ('Антон', '2 четверть', 'русский', 3),
       ('Антон', '3 четверть', 'физика', 5),
       ('Антон', '4 четверть', 'история', 3),
       ('Петя', '1 четверть', 'физика', 4),
       ('Петя', '2 четверть', 'физика', 3),
       ('Петя', '3 четверть', 'физика', 4),
       ('Петя', '4 четверть', 'физика', 5);

select *
from academic_record;